bolknote/MK61S_MINI/code/terminal.cpp
#include "terminal.hpp"
#include "Arduino.h"
#include "bounded_string.hpp"
#include "config.h"
#include "device_identity.hpp"
#include "hardware_info.hpp"
#include "rust_types.h"
#include "cross_hal.h"
#include "crc32.hpp"
#include "mk61emu_core.h"
#include "disasm.hpp"
#include "tools.hpp"
#include "library_pmk.hpp"
#include "lcd_ru.hpp"
#include "ledcontrol.h"
#include "mk_math.hpp"
#include "mk61_ref.hpp"
#include "m61_print.hpp"
#include "m61_ansi.hpp"
#include "m61_text.hpp"
#include "virtual_fat.hpp"
#include "program_store.hpp"
#include "language_workspace.hpp"
#if MK61_ANY_LOADABLE_MODULE
  #include "loadable_module_runtime.hpp"
#endif
#include "shared_scratch.hpp"
#include "shared_memory.hpp"
#include "workspace_swap.hpp"
#include "storage_path.hpp"
#include "spi_nor_flash.hpp"
#if MK61_ENABLE_READ_BENCHMARKS
  #include "read_benchmark.hpp"
#endif
#include "resident_firmware.hpp"
#include "power_monitor.hpp"
#if defined(MK61_OLED1602_WS0010)
  #include "ws0010_charset.hpp"
  #include "ws0010_graphics.hpp"
#endif
#include "terminal_command_ids.hpp"
#include "terminal_core.hpp"
#include "terminal_file_transfer.hpp"
#include "terminal_line_editor.hpp"
#include "terminal_output.hpp"
#include "terminal_protocol.hpp"
#include "usb_screen.hpp"
#include "utf8_view.hpp"
#include "rtc_clock.hpp"
#include "dwt_profiler.hpp"
#include "classic_timer.hpp"
#include "crash_dump.hpp"
#include "independent_watchdog.hpp"
#include "mpu_guard.hpp"
#include "idle_sleep.hpp"
#include "deep_idle.hpp"
#include "usb_cdc_rx_guard.hpp"
#include "usb_power.hpp"
#if MK61_ENABLE_SPI1_ARBITER
  #include "spi1_bus.hpp"
#endif
#if MK61_ENABLE_SPI1_DMA
  #include "spi1_dma.hpp"
#endif



extern  const char terminal_symbols[16];
extern  const char display_symbols[16];


#include "terminal_key_sequence.hpp"


const   u8                  CR = 0x0D;
const   u8                  NL = 0x0A;

extern  class_disassm_mk61  disassembler;
extern  void DFU_enable(void);
extern  void idle_signal_reset(void);



#include "terminal_catalog.hpp"
static const char* terminal_skip_spaces(const char* p) {
  while(p != NULL && (*p == ' ' || *p == '\t')) p++;
  return p;
}

static bool terminal_arg_end(const char* p) {
  p = terminal_skip_spaces(p);
  return p == NULL || *p == 0 || *p == '\r' || *p == '\n';
}

static bool terminal_parse_slot_arg(const char* args, usize& slot_out) {
  args = terminal_skip_spaces(args);
  if(args == NULL || *args < '0' || *args > '9') return false;

  usize slot = 0;
  const char* p = args;
  while(*p >= '0' && *p <= '9') {
    slot = slot * 10 + (usize) (*p - '0');
    if(slot > MAX_SLOT_FOR_PROGRAM) return false;
    p++;
  }
  if(!terminal_arg_end(p)) return false;
  slot_out = slot;
  return true;
}

static bool terminal_copy_arg(char* out, usize capacity, const char* args) {
  args = terminal_skip_spaces(args);
  if(out == NULL || capacity == 0 || args == NULL) return false;
  usize len = 0;
  while(args[len] != 0 && args[len] != '\r' && args[len] != '\n') len++;
  while(len > 0 && (args[len - 1] == ' ' || args[len - 1] == '\t')) len--;
  if(len == 0 || len >= capacity) return false;
  memcpy(out, args, len);
  out[len] = 0;
  return true;
}

static bool terminal_single_token(const char* args, char* out,
                                  usize capacity) {
  const char* cursor = args;
  return terminal_core::parse_token(cursor, out, capacity) &&
         terminal_core::at_end(cursor);
}

static void terminal_path_error(const char* operation,
                                storage_path::Status status) {
  Serial.print(operation);
  Serial.print(": ");
  Serial.println(storage_path::status_text(status));
}

static bool terminal_vfat_log(const char* args) {
  if(!terminal_core::at_end(args)) {
    char token[6];
    if(!terminal_single_token(args, token, sizeof(token)) ||
       strcmp(token, "clear") != 0) {
      Serial.println("Usage: vlog [clear]");
      return false;
    }
    virtual_fat::clear_diagnostic();
  }
  char line[virtual_fat::DIAGNOSTIC_LINE_SIZE];
  const auto& diagnostic = virtual_fat::diagnostic();
  if(!virtual_fat::format_diagnostic(diagnostic, line, sizeof(line))) return false;
  Serial.println(line);
  return true;
}

static void terminal_print_fs_entry(const program_store::Entry& entry) {
  char name[storage_path::VISIBLE_NAME_SIZE];
  if(!storage_path::visible_name(entry, name, sizeof(name))) {
    Serial.println("?\t<invalid entry>");
    return;
  }
  if(entry.kind == program_store::NodeKind::DIRECTORY) {
    Serial.print("d\t");
    Serial.print(name);
    Serial.println('/');
  } else {
    Serial.print("f\t");
    Serial.print(entry.data_len);
    Serial.print(" B\t");
    Serial.println(name);
  }
}

static void terminal_print_hex_byte(u8 value) {
  Serial.write(terminal_file_transfer::hex_char((u8) (value >> 4)));
  Serial.write(terminal_file_transfer::hex_char((u8) (value & 0x0F)));
}

static void terminal_print_hex_u32(u32 value) {
  terminal_print_hex_byte((u8) (value >> 24));
  terminal_print_hex_byte((u8) (value >> 16));
  terminal_print_hex_byte((u8) (value >> 8));
  terminal_print_hex_byte((u8) value);
}


const char ISA_61[] =
"0,1,2,3,4,5,6,7,8,9,dot,neg,pow10,clr,push,preX,\
add,sub,mul,div,swap,e10,exp,lg,ln,asin,acos,atg,sin,cos,tg,?,\
pi,sqrt,sqr,rec,pow,rot,toM,?,?,?,toMS,?,?,?,?,?,\
inMS,mod,sgn,inM,int,frc,max,and,or,xor,not,rnd,?,?,?,?,\
sto0,sto1,sto2,sto3,sto4,sto5,sto6,sto7,sto8,sto9,stoA,stoB,stoC,stoD,stoE,?,\
hlt,jmp,ret,call,nop,?,?,jz,rpt2,jl,rpt3,rpt1,jme,rpt0,jnz,?,\
ld0,ld1,ld2,ld3,ld4,ld5,ld6,ld7,ld8,ld9,ldA,ldB,ldC,ldD,ldE,?,\
jz[0],jz[1],jz[2],jz[3],jz[4],jz[5],jz[6],jz[7],jz[8],jz[9],jz[A],jz[B],jz[C],jz[D],jz[E],?,\
jmp[0],jmp[1],jmp[2],jmp[3],jmp[4],jmp[5],jmp[6],jmp[7],jmp[8],jmp[9],jmp[A],jmp[B],jmp[C],jmp[D],jmp[E],?,\
jlz[0],jlz[1],jlz[2],jlz[3],jlz[4],jlz[5],jlz[6],jlz[7],jlz[8],jlz[9],jlz[A],jlz[B],jlz[C],jlz[D],jlz[E],?,\
call[0],call[1],call[2],call[3],call[4],call[5],call[6],call[7],call[8],call[9],call[A],call[B],call[C],call[D],call[E],?,\
sto[0],sto[1],sto[2],sto[3],sto[4],sto[5],sto[6],sto[7],sto[8],sto[9],sto[A],sto[B],sto[C],sto[D],sto[E],?,\
jme[0],jme[1],jme[2],jme[3],jme[4],jme[5],jme[6],jme[7],jme[8],jme[9],jme[A],jme[B],jme[C],jme[D],jme[E],?,\
ld[0],ld[1],ld[2],ld[3],ld[4],ld[5],ld[6],ld[7],ld[8],ld[9],ld[A],ld[B],ld[C],ld[D],ld[E],?,\
jnz[0],jnz[1],jnz[2],jnz[3],jnz[R4],jnz[5],jnz[6],jnz[7],jnz[8],jnz[9],jnz[A],jnz[B],jnz[C],jnz[D],jnz[E]";


static const char ISA_CLASSIC_61[] =
"0,1,2,3,4,5,6,7,8,9,.,/-/,В\317,CX,B^,Bx,+,-,*,:,XY,F10^x,Fe^x,Flg,Fln,Fasin,Facos,Fatg,Fsin,Fcos,Ftg,?,\
\317\xE8,V\"\"\",Fx^2,F1/x,Fx^y,(),Ko->',?,?,?,Ko->'\",?,?,?,?,?,Ko<-'\",|x|,3H,Ko<-',K[x],K{x},Kmax,K^,Kv,K(+),\310HB,C\327,?,Ko->'\",?,?,\
X->\3170,X->\3171,X->\3172,X->\3173,X->\3174,X->\3175,X->\3176,X->\3177,X->\3178,X->\3179,X->\317A,X->\317B,X->\317C,X->\317\304,X->\317E,?,\
C/\317,\301/\317,B/O,\317/\317,HO\317,?,?,Fx\2070,FL2,Fx>=0,FL3,FL1,Fx<0,FL0,Fx=0,?,\
\317->X0,\317->X1,\317->X2,\317->X3,\317->X4,\317->X5,\317->X6,\317->X7,\317->X8,\317->X9,\317->XA,\317->XB,\317->XC,\317->X\xC4,\317->XE,?,\
Kx\2070 0,Kx\2070 1,Kx\2070 2,Kx\2070 3,Kx\2070 4,Kx\2070 5,Kx\2070 6,Kx\2070 7,Kx\2070 8,Kx\2070 9,Kx\2070 A,Kx\2070 B,Kx\2070 C,Kx\2070 \304,Kx\2070 E,?,\
K\301\3170,K\301\3171,K\301\3172,K\301\3173,K\301\3174,K\301\3175,K\301\3176,K\301\3177,K\301\3178,K\301\3179,K\301\317A,K\301\317B,K\301\317C,K\301\317\304,K\301\317E,?,\
Kx>=0 0,Kx>=0 1,Kx>=0 2,Kx>=0 3,Kx>=0 4,Kx>=0 5,Kx>=0 6,Kx>=0 7,Kx>=0 8,Kx>=0 9,Kx>=0 A,Kx>=0 B,Kx>=0 C,Kx>=0 \304,Kx>=0 E,?,\
К\317\3170,К\317\3171,К\317\3172,К\317\3173,К\317\3174,К\317\3175,К\317\3176,К\317\3177,К\317\3178,К\317\3179,К\317\317A,К\317\317B,К\317\317C,К\317\317\304,К\317\317E,?,\
KX->\3170,KX->\3171,KX->\3172,KX->\3173,KX->\3174,KX->\3175,KX->\3176,KX->\3177,KX->\3178,KX->\3179,KX->\317A,KX->\317B,KX->\317C,KX->\317\304,KX->\317E,?,\
Kx<0 0,Kx<0 1,Kx<0 2,Kx<0 3,Kx<0 4,Kx<0 5,Kx<0 6,Kx<0 7,Kx<0 8,Kx<0 9,Kx<0 A,Kx<0 B,Kx<0 C,Kx<0 \304,Kx<0 E,?,\
K\317->X0,K\317->X1,K\317->X2,K\317->X3,K\317->X4,K\317->X5,K\317->X6,K\317->X7,K\317->X8,K\317->XA,K\317->XB,K\317->XC,K\317->X\304,K\317->XE,?,\
Kx=0 0,Kx=0 1,Kx=0 2,Kx=0 3,Kx=0 4,Kx=0 5,Kx=0 6,Kx=0 7,Kx=0 8,Kx=0 9,Kx=0 A,Kx=0 B,Kx=0 C,Kx=0 \304,Kx=0 E,?";

#if MK61_DWT_PROFILER_SUPPORTED && MK61_ENABLE_PROFILE_SAVE
class class_terminal::ProfileReportBuilder {
      public:
        ProfileReportBuilder(u8* output, usize capacity)
          : output_(output), capacity_(capacity), length_(0),
            valid_(output != NULL) {}

