bolknote/MK61S_MINI/code/terminal.cpp
        void append_text(const char* text) {
          if(!valid_ || text == NULL) {
            valid_ = false;
            return;
          }
          while(*text != 0) append_char(*text++);
        }

        void append_char(char value) {
          if(!valid_ || length_ >= capacity_) {
            valid_ = false;
            return;
          }
          output_[length_++] = (u8) value;
        }

        void append_u64(u64 value) {
          char digits[21];
          usize length = 0;
          do {
            digits[length++] = (char) ('0' + value % 10U);
            value /= 10U;
          } while(value != 0 && length < sizeof(digits));
          while(length != 0) append_char(digits[--length]);
        }

        bool valid(void) const { return valid_; }
        usize length(void) const { return length_; }

      private:
        u8* output_;
        usize capacity_;
        usize length_;
        bool valid_;
    };
#endif

m61_ansi::SavedCursor class_terminal::print_saved_cursor = {};
u8 class_terminal::input_buffer[MAX_INPUT_CHAR] = {};
char  class_terminal::hist_text[HISTORY_TEXT_SIZE] = {};
u16   class_terminal::hist_start[HISTORY_DEPTH] = {};
u8    class_terminal::hist_length[HISTORY_DEPTH] = {};
u8    class_terminal::hist_head = {};
u8    class_terminal::hist_count = {};
u16   class_terminal::hist_used = {};
u16   class_terminal::hist_write = {};
i8    class_terminal::hist_nav = {};
terminal_line_editor::EscapeDecoder class_terminal::escape_decoder = {};
u8    class_terminal::prev_terminator = {};
u8    class_terminal::saved_line[MAX_INPUT_CHAR] = {};
usize class_terminal::saved_len = {};
usize class_terminal::saved_cursor = {};

void class_terminal::history_drop_oldest(void) {
      hist_used -= hist_length[hist_head];
      hist_head = (u8) ((hist_head + 1) % HISTORY_DEPTH);
      hist_count--;
    }

void class_terminal::history_entry_read(u8 slot, u8* out) {
      const u16 start = hist_start[slot];
      for(u8 i = 0; i < hist_length[slot]; i++) out[i] = (u8) hist_text[(u16) ((start + i) % HISTORY_TEXT_SIZE)];
    }

bool class_terminal::history_entry_equals(u8 slot, const u8* line, usize len) {
      if(hist_length[slot] != len) return false;
      const u16 start = hist_start[slot];
      for(usize i = 0; i < len; i++) {
        if((u8) hist_text[(u16) ((start + i) % HISTORY_TEXT_SIZE)] != line[i]) return false;
      }
      return true;
    }

void class_terminal::history_add(const u8* line, usize len) {
      if(len == 0 || len >= HISTORY_TEXT_SIZE) return;
      // подряд идущие одинаковые команды не дублируем
      if(hist_count > 0 && history_entry_equals((u8) ((hist_head + hist_count - 1) % HISTORY_DEPTH), line, len)) return;

      while(hist_count > 0 && (hist_used + len > HISTORY_TEXT_SIZE || hist_count >= HISTORY_DEPTH)) history_drop_oldest();

      const u8 slot = (u8) ((hist_head + hist_count) % HISTORY_DEPTH);
      hist_start[slot] = hist_write;
      hist_length[slot] = (u8) len;
      for(usize i = 0; i < len; i++) {
        hist_text[hist_write] = (char) line[i];
        hist_write = (u16) ((hist_write + 1) % HISTORY_TEXT_SIZE);
      }
      hist_used += len;
      hist_count++;
    }

void class_terminal::history_print(void) {
      if(hist_count == 0) {
        Serial.println("History is empty.");
        return;
      }
      u8 line[MAX_INPUT_CHAR];
      for(u8 i = 0; i < hist_count; i++) {
        const u8 slot = (u8) ((hist_head + i) % HISTORY_DEPTH);
        history_entry_read(slot, line);
        Serial.print("  ");
        Serial.print(i + 1);
        Serial.print(": ");
        Serial.write(line, hist_length[slot]);
        Serial.println();
      }
    }

void class_terminal::print_prompt(void) {
      char path[64];
      if(storage_path::format_directory(current_directory, path,
                                        sizeof(path)) ==
         storage_path::Status::OK) Serial.print(path);
      else Serial.print("...");
      Serial.print("> ");
    }

void class_terminal::move_terminal_cursor(char direction, usize columns) {
      if(columns == 0) return;
      Serial.write(0x1B);
      Serial.write('[');
      Serial.print(columns);
      Serial.write(direction);
    }

usize class_terminal::input_columns(usize begin, usize end) const {
      if(begin >= end || end > recive_pos) return 0;
      return utf8_view::codepoint_count(
          (const char*) input_buffer + begin, (u16) (end - begin));
    }

void class_terminal::redraw_input_line(void) {
      Serial.write('\r');
      print_prompt();
      Serial.write(input_buffer, recive_pos);
      Serial.print("\x1B[K");
      move_terminal_cursor('D', input_columns(input_cursor, recive_pos));
    }

void class_terminal::history_recall(i8 nav) {
      if(nav < 0) {  // выход из истории: вернуть редактируемую строку
        memcpy(input_buffer, saved_line, saved_len);
        recive_pos = saved_len;
        input_cursor = saved_cursor;
      } else {
        const u8 slot = (u8) ((hist_head + hist_count - 1 - nav) % HISTORY_DEPTH);
        history_entry_read(slot, input_buffer);
        recive_pos = hist_length[slot];
        input_cursor = recive_pos;
      }
      input_buffer[recive_pos] = 0;
      hist_nav = nav;
      redraw_input_line();
    }

void class_terminal::history_key_up(void) {
      if(hist_nav + 1 >= (i8) hist_count) return;
      if(hist_nav < 0) {  // запомнить строку, набранную до входа в историю
        memcpy(saved_line, input_buffer, recive_pos);
        saved_len = recive_pos;
        saved_cursor = input_cursor;
      }
      history_recall((i8) (hist_nav + 1));
    }

void class_terminal::history_key_down(void) {
      if(hist_nav < 0) return;
      history_recall((i8) (hist_nav - 1));
    }

void class_terminal::editor_move_left(void) {
      if(terminal_line_editor::move_left(input_buffer, recive_pos,
                                         input_cursor)) {
        move_terminal_cursor('D', 1);
      }
    }

void class_terminal::editor_move_right(void) {
      if(terminal_line_editor::move_right(input_buffer, recive_pos,
                                          input_cursor)) {
        move_terminal_cursor('C', 1);
      }
    }

void class_terminal::editor_move_home(void) {
      const usize columns = input_columns(0, input_cursor);
      input_cursor = 0;
      move_terminal_cursor('D', columns);
    }

