bolknote/MK61S_MINI/code/terminal.cpp
void class_terminal::editor_move_end(void) {
      const usize columns = input_columns(input_cursor, recive_pos);
      input_cursor = recive_pos;
      move_terminal_cursor('C', columns);
    }

void class_terminal::editor_backspace(void) {
      if(terminal_line_editor::backspace(input_buffer, recive_pos,
                                         input_cursor, MAX_INPUT_CHAR)) {
        redraw_input_line();
      }
    }

void class_terminal::editor_delete_forward(void) {
      if(terminal_line_editor::delete_forward(input_buffer, recive_pos,
                                              input_cursor,
                                              MAX_INPUT_CHAR)) {
        redraw_input_line();
      }
    }

bool class_terminal::editor_insert(u8 byte) {
      const bool at_end = input_cursor == recive_pos;
      if(!terminal_line_editor::insert_byte(input_buffer, recive_pos,
                                            input_cursor, MAX_INPUT_CHAR,
                                            byte)) return false;
      if(at_end) Serial.write(byte);
      else redraw_input_line();
      return true;
    }

void class_terminal::editor_key(terminal_line_editor::Key key) {
      switch(key) {
        case terminal_line_editor::Key::UP:             history_key_up(); break;
        case terminal_line_editor::Key::DOWN:           history_key_down(); break;
        case terminal_line_editor::Key::RIGHT:          editor_move_right(); break;
        case terminal_line_editor::Key::LEFT:           editor_move_left(); break;
        case terminal_line_editor::Key::HOME:           editor_move_home(); break;
        case terminal_line_editor::Key::END:            editor_move_end(); break;
        case terminal_line_editor::Key::DELETE_FORWARD: editor_delete_forward(); break;
        case terminal_line_editor::Key::NONE:            break;
      }
    }

void class_terminal::print_help(void) {
      Serial.println("Available commands:");
      for(usize i = 0; i < terminal_catalog::count(); i++) {
        const auto command = terminal_catalog::at(i);
        if(command.desc == NULL) continue;
        Serial.print("  ");
        Serial.print(command.name);
        for(usize pad = strlen(command.name); pad < 8; pad++) Serial.write(' ');
        Serial.println(command.desc);
      }
      Serial.println("  R<r>=   R<r>= <value> - write register, e.g. R0= 3.14");
      Serial.println("  set$    set$<addr> <hex> - write program memory");
    }

#if MK61_CRASH_DUMP_SUPPORTED
void class_terminal::print_crash_usage(void) {
      #if MK61_ENABLE_FAULT_INJECTION
      Serial.println(
          "Usage: crash [show|clear|save [path.txt]|test <usage|bus|hard>]");
      #else
      Serial.println("Usage: crash [show|clear|save [path.txt]]");
      #endif

    }

terminal_protocol::Result class_terminal::show_crash_dump(void) {
      crash_dump_format::Record record = {};
      if(!crash_dump::copy(record)) {
        terminal_output::field(
            Serial, "CRASH none reset=0x", crash_dump::boot_reset_flags(), HEX);
        terminal_output::line(
            Serial, " layout=", crash_dump::memory_layout_valid() ? "ok" : "invalid");
        return terminal_protocol::Result::ok();
      }

      shared_scratch::Lease scratch(
          shared_scratch::Owner::TERMINAL_TRANSFER,
          program_store::MAX_MK61_TEXT_SIZE);
      if(!scratch.ok()) {
        Serial.println("CRASH show busy");
        return terminal_protocol::Result::error();
      }
      const u16 length = crash_dump::format_report(
          record, scratch.data(), scratch.size());
      if(length == 0) {
        Serial.println("CRASH report failed");
        return terminal_protocol::Result::error();
      }
      Serial.write(scratch.data(), length);
      return terminal_protocol::Result::ok();
    }

terminal_protocol::Result class_terminal::save_crash_dump(const char* path) {
      crash_dump_format::Record record = {};
      if(!crash_dump::copy(record)) {
        Serial.println("CRASH no retained record");
        return terminal_protocol::Result::error();
      }

      storage_path::FileTarget target = {};
      const storage_path::Status path_status = storage_path::file_target(
          current_directory, path, program_store::ProgramType::TEXT, target);
      if(path_status != storage_path::Status::OK) {
        terminal_path_error("crash save", path_status);
        return terminal_protocol::Result::error();
      }

      shared_scratch::Lease scratch(
          shared_scratch::Owner::TERMINAL_TRANSFER,
          program_store::MAX_MK61_TEXT_SIZE);
      if(!scratch.ok()) {
        Serial.println("CRASH save busy");
        return terminal_protocol::Result::error();
      }
      const u16 length = crash_dump::format_report(
          record, scratch.data(), scratch.size());
      if(length == 0 ||
         !program_store::write_file(
             target.parent_id, program_store::INVALID_ID,
             program_store::ProgramType::TEXT, target.name,
             scratch.data(), length)) {
        Serial.println("CRASH save failed");
        return terminal_protocol::Result::error();
      }
      (void) crash_dump::mark_persisted();
      terminal_output::field(Serial, "CRASH saved ", path);
      terminal_output::line(Serial, " bytes=", length);
      return terminal_protocol::Result::ok();
    }

terminal_protocol::Result class_terminal::exec_crash(void) {
      const char* cursor = command_args();
      if(terminal_core::at_end(cursor)) return show_crash_dump();

      char action[12];
      if(!terminal_core::parse_token(cursor, action, sizeof(action))) {
        print_crash_usage();
        return terminal_protocol::Result::error();
      }
      if(strcmp(action, "show") == 0) {
        if(!terminal_core::at_end(cursor)) {
          print_crash_usage();
          return terminal_protocol::Result::error();
        }
        return show_crash_dump();
      }
      if(strcmp(action, "clear") == 0) {
        if(!terminal_core::at_end(cursor)) {
          print_crash_usage();
          return terminal_protocol::Result::error();
        }
        crash_dump::clear();
        Serial.println("CRASH cleared");
        return terminal_protocol::Result::ok();
      }
      if(strcmp(action, "save") == 0) {
        char path[MAX_INPUT_CHAR];
        if(terminal_core::at_end(cursor)) {
          bounded_string::copy(path, "CRASH.TXT");
        } else if(!terminal_copy_arg(path, sizeof(path), cursor)) {
          print_crash_usage();
          return terminal_protocol::Result::error();
        }
        return save_crash_dump(path);
      }

      #if MK61_ENABLE_FAULT_INJECTION
      if(strcmp(action, "test") == 0) {
        char fault[12];
        if(!terminal_core::parse_token(cursor, fault, sizeof(fault)) ||
           !terminal_core::at_end(cursor)) {
          print_crash_usage();
          return terminal_protocol::Result::error();
        }
        terminal_output::line(Serial, "CRASH injecting ", fault);
        Serial.flush();
        delay(20);
        if(strcmp(fault, "usage") == 0) crash_dump::inject_usage_fault();
        if(strcmp(fault, "bus") == 0) crash_dump::inject_bus_fault();
        if(strcmp(fault, "hard") == 0) crash_dump::inject_hard_fault();
      }
      #endif

      print_crash_usage();
      return terminal_protocol::Result::error();
    }

#endif
#if MK61_MPU_GUARD_SUPPORTED
void class_terminal::print_mpu_usage(void) {
      #if MK61_ENABLE_MPU_TEST
      Serial.println("Usage: mpu [status|test <guard|null|exec>]");
      #else
      Serial.println("Usage: mpu [status]");
      #endif
    }

terminal_protocol::Result class_terminal::show_mpu_status(void) {
      const mpu_guard::Snapshot snapshot = mpu_guard::statistics();
      terminal_output::field(Serial, "MPU backend=", mpu_guard::backend_name());
      terminal_output::field(Serial, " enabled=", snapshot.enabled ? 1 : 0);
      terminal_output::field(Serial, " layout=", snapshot.layout_valid ? "ok" : "invalid");
      terminal_output::field(Serial, " regions=", snapshot.available_regions);
      Serial.print('/');
      Serial.print(snapshot.required_regions);
      terminal_output::field(Serial, " ram=0x", snapshot.ram_start, HEX);
      terminal_output::field(Serial, "..0x", snapshot.ram_end, HEX);
      terminal_output::field(Serial, " static_end=0x", snapshot.static_end, HEX);
      terminal_output::field(Serial, " guard=0x", snapshot.guard_base, HEX);
      Serial.print('+');
      Serial.print(snapshot.guard_size);
      terminal_output::field(Serial, " stack_budget=", snapshot.stack_budget);
      terminal_output::field(Serial, " msp=0x", snapshot.current_msp, HEX);
      terminal_output::field(Serial, " observed_low=0x", snapshot.lowest_observed_msp, HEX);
      terminal_output::field(
          Serial, " sampled_remaining=", snapshot.sampled_remaining_stack_bytes());
      terminal_output::field(Serial, " watermark=", snapshot.stack_watermark_enabled ? 1 : 0);
      terminal_output::field(
          Serial, " watermark_remaining=", snapshot.watermark_remaining_stack_bytes);
      terminal_output::field(
          Serial, " observed_remaining=", snapshot.remaining_stack_bytes());
      terminal_output::line(Serial, " sram_xn=", snapshot.sram_execute_never ? 1 : 0);
      return snapshot.enabled
          ? terminal_protocol::Result::ok()
          : terminal_protocol::Result::error();
    }

terminal_protocol::Result class_terminal::exec_mpu(void) {
      const char* cursor = command_args();
      if(terminal_core::at_end(cursor)) return show_mpu_status();

      char action[12];
      if(!terminal_core::parse_token(cursor, action, sizeof(action))) {
        print_mpu_usage();
        return terminal_protocol::Result::error();
      }
      if(strcmp(action, "status") == 0 && terminal_core::at_end(cursor)) {
        return show_mpu_status();
      }

