bolknote/MK61S_MINI/code/terminal.cpp
        usize seconds = 0;
        usize cycles = 1;
        if(!terminal_core::parse_unsigned(
               cursor, 10, deep_idle_policy::MAX_SECONDS, seconds) ||
           seconds < deep_idle_policy::MIN_SECONDS ||
           (!terminal_core::at_end(cursor) &&
            !terminal_core::parse_unsigned(
                cursor, 10, deep_idle_policy::MAX_CYCLES, cycles)) ||
           cycles < deep_idle_policy::MIN_CYCLES ||
           !terminal_core::at_end(cursor)) {
          Serial.println(
              "Usage: prof deep <1..5 seconds> [1..1000 cycles]|cancel");
          return terminal_protocol::Result::error();
        }
        if(!deep_idle::request((u8) seconds, (u16) cycles, millis())) {
          Serial.println("PROF deep busy/unavailable");
          return terminal_protocol::Result::error();
        }
        terminal_output::field(Serial, "PROF deep scheduled seconds=", seconds);
        terminal_output::field(Serial, " cycles=", cycles);
#if MK61_USB_SUSPEND_SUPPORTED
        Serial.println(
            "; waiting for host USB suspend; USB will stay enumerated");
#else
        Serial.println("; USB and OLED will disconnect after 750 ms");
#endif
        return terminal_protocol::Result::ok();
      }
#endif
      if(!terminal_core::at_end(cursor)) {
#if MK61_ENABLE_PROFILE_SAVE
        Serial.println("Usage: prof [start|stop|reset|core [steps]|save [path.txt]]");
#else
        Serial.println("Usage: prof [start|stop|reset|core [steps]]");
#endif
        return terminal_protocol::Result::error();
      }
      if(strcmp(action, "start") == 0) {
        if(!dwt_profiler::start()) {
          Serial.println("PROF unavailable");
          return terminal_protocol::Result::error();
        }
        classic_timer::reset_statistics();
        idle_sleep::reset_statistics();
#if MK61_DEEP_IDLE_SUPPORTED
        deep_idle::reset_statistics();
#endif
        #if MK61_ENABLE_SPI1_DMA
        spi1_dma::reset_statistics();
        #endif
        usb_cdc_rx_guard::reset_statistics();
        usb_power::reset_statistics();
        kbd::reset_stop_wake_statistics();
        Serial.println("PROF started");
        return terminal_protocol::Result::ok();
      }
      if(strcmp(action, "stop") == 0) {
        dwt_profiler::stop();
        print_profile_statistics();
        return terminal_protocol::Result::ok();
      }
      if(strcmp(action, "reset") == 0) {
        dwt_profiler::reset();
        classic_timer::reset_statistics();
        idle_sleep::reset_statistics();
#if MK61_DEEP_IDLE_SUPPORTED
        deep_idle::reset_statistics();
#endif
        #if MK61_ENABLE_SPI1_DMA
        spi1_dma::reset_statistics();
        #endif
        usb_cdc_rx_guard::reset_statistics();
        usb_power::reset_statistics();
        kbd::reset_stop_wake_statistics();
        Serial.println("PROF reset");
        return terminal_protocol::Result::ok();
      }

#if MK61_ENABLE_PROFILE_SAVE
      Serial.println("Usage: prof [start|stop|reset|core [steps]|save [path.txt]]");
#else
      Serial.println("Usage: prof [start|stop|reset|core [steps]]");
#endif
      return terminal_protocol::Result::error();
    }

#endif
terminal_protocol::Result class_terminal::script_action(terminal_protocol::ResultKind action, const char* args) {
      recive_pos = 0;
      return terminal_protocol::Result::action(action, args);
    }

bool class_terminal::input_can_append(void) const {
      return terminal_core::input_can_append(recive_pos);
    }

void class_terminal::list_mk61_code_page(void) {
      u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
      core_61::get_code_page(&code_page[0]);
      const usize program_steps = core_61::program_steps();

      for(int j = 0; j < 16; j++) {
        for(usize i = j; i < program_steps; i += 16) {
          if(i > 99) {
            Serial.write('A');
            Serial.print(i-100);
          } else {
            if(i < 10) Serial.write('0');
            Serial.print(i);
          }
          Serial.print(". ");
          if(code_page[i] < 16) Serial.write('0');
          Serial.print(code_page[i], HEX);
          Serial.print("  ");
        }
        Serial.println();
      }
    }

void class_terminal::dump_mk61_code_page(void) {
      u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
      core_61::get_code_page(&code_page[0]);
      const isize program_steps = (isize) core_61::program_steps();
      isize j = 0;
      do {
        for(isize i = 0; i < 16; i++) {
          Serial_write_hex(code_page[j]);
          Serial.print("  ");
          j++;
          if ( j >= program_steps ) break;
        }
        Serial.println();
      } while (j < program_steps);
    }

char* class_terminal::ISA_61_code(u8 opcode, char* text) {
      isize comma_count = opcode;
      isize i = 0;

      for(u8 symbol : ISA_61) {
        if(symbol == 0) break;
        if(symbol == ',') {
          comma_count--;
        } else if(comma_count == 0)
          text[i++] = symbol;
      }
      text[i] = 0;
      return text;
    }

char* class_terminal::ISA_CLASSIC_61_code(u8 opcode, char* text) {
      isize comma_count = opcode;
      isize i = 0;

      for(const char* p = ISA_CLASSIC_61; *p != 0; p++) {
        const u8 symbol = (u8) *p;
        if(symbol == 0) break;
        if(symbol == ',') {
          comma_count--;
        } else if(comma_count == 0)
          text[i++] = symbol;
      }
      text[i] = 0;
      return text;
    }

void class_terminal::output_version(void) {
      Serial.print("sizeof Serial "); Serial.println(sizeof(HardwareSerial));
      Serial.print(MODEL);
      Serial.print(" ver. ");
      Serial.print(__DATE__);
      Serial.write('(');
      Serial.print(__TIME__);
      Serial.println(')');
    }

terminal_protocol::Result class_terminal::exec_identity(void) {
      if(!terminal_core::at_end(command_args())) {
        Serial.println("Usage: identity");
        return terminal_protocol::Result::error();
      }

      char report[device_identity::REPORT_TEXT_SIZE];
      const usize length = device_identity::format_report(
          device_identity::read(), virtual_fat::volume_serial(),
          crash_dump::current_build_id(), crash_dump::current_build_profile(),
          report, sizeof(report));
      if(length == 0) {
        Serial.println("IDENTITY report failed");
        return terminal_protocol::Result::error();
      }
      Serial.println(report);
      return terminal_protocol::Result::ok();
    }

#if MK61_ENABLE_READ_BENCHMARKS
void class_terminal::print_benchmark_pass(u8 pass, u32 elapsed_us, u32 crc) {
      terminal_output::field(Serial, "BENCH pass=", pass);
      terminal_output::field(Serial, " read_us=", elapsed_us);
      Serial.print(" crc=0x");
      terminal_print_hex_u32(crc);
      Serial.println();
    }

terminal_protocol::Result class_terminal::print_benchmark_summary(
        const char* kind, u32 bytes,
        const read_benchmark::Summary& summary) {
      if(summary.samples == 0 || !summary.crc_consistent) {
        Serial.println("BENCH error=data-mismatch");
        return terminal_protocol::Result::error();
      }
      terminal_output::field(Serial, "BENCH summary kind=", kind);
      terminal_output::field(Serial, " bytes=", bytes);
      terminal_output::field(Serial, " passes=", summary.samples);
      terminal_output::field(Serial, " min_us=", summary.minimum_us);
      terminal_output::field(Serial, " avg_us=", summary.average_us());
      terminal_output::field(Serial, " max_us=", summary.maximum_us);
      terminal_output::field(Serial, " read_Bps=", summary.bytes_per_second(bytes));
      Serial.print(" crc=0x");
      terminal_print_hex_u32(summary.reference_crc);
      Serial.println();
      return terminal_protocol::Result::ok();
    }

terminal_protocol::Result class_terminal::benchmark_file(const char* cursor) {
      char path[MAX_INPUT_CHAR];
      usize passes = 5;
      if(!terminal_core::parse_token(cursor, path, sizeof(path)) ||
         (!terminal_core::at_end(cursor) &&
          !terminal_core::parse_unsigned(cursor, 10, 20, passes)) ||
         passes == 0 || !terminal_core::at_end(cursor)) {
        Serial.println("Usage: bench file <path> [1..20 passes]");
        return terminal_protocol::Result::error();
      }

      program_store::Entry entry;
      const storage_path::Status status = storage_path::resolve_file(
          current_directory, path, entry);
      if(status != storage_path::Status::OK) {
        terminal_path_error("bench", status);
        return terminal_protocol::Result::error();
      }
      if(entry.data_len > program_store::MAX_MK61_TEXT_SIZE) {
        terminal_output::line(
            Serial, "BENCH error=file-too-large max=", program_store::MAX_MK61_TEXT_SIZE);
        return terminal_protocol::Result::error();
      }

