bolknote/MK61S_MINI/code/terminal.cpp
      char name[2] = {args[0], 0};
      mk61_ref::Ref ref;
      if(!mk61_ref::parse_name(name, ref) || ref.kind == mk61_ref::Kind::R) return false;

      double value = 0.0;
      if(!terminal_core::parse_single_decimal(args + 1, value) || !value_fits_mk61(value)) return false;
      return mk61_ref::write(ref, value);
    }

const char* class_terminal::command_args(void) {
      const char* p = (const char*) input_buffer;
      while(!terminal_core::is_end(*p) && !terminal_core::is_space(*p)) p++;
      return terminal_core::skip_spaces(p);
    }

isize class_terminal::parse_u32_list(const char* p, u32* out, usize max_count) {
      usize count = 0;
      while(true) {
        while(*p == ' ' || *p == ',') p++;
        if(*p == 0) break;
        if(*p < '0' || *p > '9') return -1;
        u32 value = 0;
        while(*p >= '0' && *p <= '9') {
          const u32 digit = (u32) (*p++ - '0');
          if(value > (0xFFFFFFFFUL - digit) / 10) return -1;
          value = value * 10 + digit;
        }
        if(count >= max_count) return -1;
        out[count++] = value;
      }
      return (isize) count;
    }

bool class_terminal::exec_led(void) {
      u32 values[2 * led::PATTERN_MAX - 1];
      const isize n = parse_u32_list(command_args(), values, 2 * led::PATTERN_MAX - 1);
      if(n <= 0 || (n % 2) == 0) return false; // нечётный список: state,ms,...,state

      led::PatternStep steps[led::PATTERN_MAX];
      usize count = 0;
      for(isize i = 0; i < n; i += 2) {
        if(values[i] > 1) return false;
        if(i + 1 < n && values[i + 1] > 65535) return false; // пауза хранится в u16
        steps[count].on = (u8) values[i];
        steps[count].hold_ms = (u16) ((i + 1 < n) ? values[i + 1] : 0);
        count++;
      }
      return led::pattern_start(steps, count);
    }

bool class_terminal::exec_beep(void) {
      u32 values[2 * SOUND_PATTERN_MAX];
      const isize n = parse_u32_list(command_args(), values, 2 * SOUND_PATTERN_MAX);
      if(n <= 0 || (n % 2) != 0) return false;

      SoundNote notes[SOUND_PATTERN_MAX];
      const usize count = (usize) n / 2;
      for(usize i = 0; i < count; i++) {
        if(values[2 * i] > 65535 || values[2 * i + 1] > 65535) return false; // u16 в SoundNote
        notes[i].frequency_Hz = (u16) values[2 * i];
        notes[i].duration_ms = (u16) values[2 * i + 1];
        notes[i].gap_ms = 0;
        notes[i].volume_percent = 100;
      }
      return sound_pattern_start(notes, count);
    }

bool class_terminal::parse_mk_display_value(const char* v, double& out) {
      char buffer[20];
      char* w = buffer;
      if(v[0] == '-') *w++ = '-';
      for(int i = 1; i <= 9; i++) {
        const char c = v[i];
        if(c == '.') { *w++ = c; continue; }
        if(c == ' ') continue;
        if(c < '0' || c > '9') return false;
        *w++ = c;
      }
      if(v[12] < '0' || v[12] > '9' || v[13] < '0' || v[13] > '9') return false;
      *w++ = 'e';
      *w++ = (v[11] == '-') ? '-' : '+';
      *w++ = v[12];
      *w++ = v[13];
      *w = 0;
      out = mk_math::atof(buffer);
      return true;
    }

bool class_terminal::operand_delimiter(char c) {
      return terminal_core::is_end(c) || terminal_core::is_space(c) || c == '<' || c == '>' || c == '=' || c == '!';
    }

bool class_terminal::parse_if_operand(const char*& p, double& out) {
      p = terminal_core::skip_spaces(p);
      const char c = (*p >= 'A' && *p <= 'Z') ? (char) (*p - 'A' + 'a') : *p;

      if(c == 'r') {
        const isize reg = HexdecimalDigit(p[1]);
        if(reg >= 0 && operand_delimiter(p[2])) {
          if(reg == 15 && !core_61::expanded_program_is_on()) return false;
          char value[15];
          value[14] = 0;
          MK61Emu_ReadRegister((int) reg, value, terminal_symbols);
          p += 2;
          return parse_mk_display_value(value, out);
        }
        return false;
      }

      if(c == 'x' || c == 'y' || c == 'z' || c == 't') {
        stack reg = stack::X;
        usize advance = 1;
        if(c == 'x' && p[1] == '1') { reg = stack::X1; advance = 2; }
        else if(c == 'x') reg = stack::X;
        else if(c == 'y') reg = stack::Y;
        else if(c == 'z') reg = stack::Z;
        else reg = stack::T;
        if(!operand_delimiter(p[advance])) return false;

        char value[15];
        value[14] = 0;
        read_stack_register(reg, value, terminal_symbols);
        p += advance;
        return parse_mk_display_value(value, out);
      }

      return terminal_core::parse_decimal(p, out);
    }

bool class_terminal::screen_put_byte(u8 x, u8 y, u8 value, void* user_data) {
      MK61Display& display = *(MK61Display*) user_data;
      display.setCursor(x, y);
      return display.write(value) == 1;
    }

bool class_terminal::screen_clear(void* user_data) {
      ((MK61Display*) user_data)->clear();
      return true;
    }

bool class_terminal::print_byte(u8 value, void* user_data) {
      PrintRenderContext& context = *(PrintRenderContext*) user_data;
      return context.writer->write(value);
    }

bool class_terminal::print_text(const char* text, PrintRenderContext& context) {
      if(text == nullptr) return false;
      while(*text != 0) {
        if(!context.writer->write((u8) *text++)) return false;
      }
      return true;
    }

bool class_terminal::print_number_text(const char text[15],
                                  m61_print::ValueFormat format,
                                  PrintRenderContext& context) {
      const auto ascii_digit = [](u8 value) {
        return value == (u8) display_symbols[0] ? (u8) '0' : value;
      };
      switch(format) {
        case m61_print::ValueFormat::INDICATOR:
          return print_text(text, context);
        case m61_print::ValueFormat::MANTISSA_HEAD:
          return context.writer->write(ascii_digit((u8) text[1]));
        case m61_print::ValueFormat::ABS_EXPONENT: {
          const u8 tens = ascii_digit((u8) text[12]);
          if(tens != '0' && !context.writer->write(tens)) return false;
          return context.writer->write(ascii_digit((u8) text[13]));
        }
      }
      return false;
    }

bool class_terminal::print_value(const m61_print::ValueRef& value, void* user_data) {
      PrintRenderContext& context = *(PrintRenderContext*) user_data;
      char text[15];
      text[14] = 0;
      if(value.kind == m61_print::ValueKind::REGISTER) {
        MK61Emu_ReadRegister((int) value.index, text, display_symbols);
        return print_number_text(text, value.format, context);
      }

      const m61_print::StackValue stack_value =
          (m61_print::StackValue) value.index;
      if(stack_value == m61_print::StackValue::X2) {
        return print_text(MK61Emu_GetIndicatorStr(display_symbols), context);
      }

      stack reg = stack::X;
      switch(stack_value) {
        case m61_print::StackValue::X: reg = stack::X; break;
        case m61_print::StackValue::Y: reg = stack::Y; break;
        case m61_print::StackValue::Z: reg = stack::Z; break;
        case m61_print::StackValue::T: reg = stack::T; break;
        case m61_print::StackValue::X1: reg = stack::X1; break;
        case m61_print::StackValue::X2: break;
      }
      read_stack_register(reg, text, display_symbols);
      return print_number_text(text, value.format, context);
    }

bool class_terminal::exec_print(bool script_mode) {
      MK61Display& display = main_lcd();
      const m61_print::Control control =
          m61_print::parse_control(command_args());
      if(control != m61_print::Control::NONE) {
        if(!script_mode) {
          Serial.println("print off/on work in M61 scripts only");
          return false;
        }
        if(control == m61_print::Control::OFF) {
          MK61DisplayUpdate update(display);
          display.clear();
          display.setCursor(0, 0);
          print_saved_cursor = {};
          m61_text::claim_display();
        } else {
          m61_text::release_display();
        }
        return true;
      }
      const m61_ansi::Sink sink = {
        screen_put_byte, screen_clear, &display
      };
      m61_ansi::Writer writer(
          display.cols(), display.rows(), display.cursorX(), display.cursorY(),
          print_saved_cursor, sink);
      PrintRenderContext context = {&writer};
      MK61DisplayUpdate update(display);
      const m61_print::Result result = m61_print::render(
          command_args(), core_61::expanded_program_is_on(),
          print_byte, print_value, &context);
      display.setCursor(writer.cursorX(), writer.cursorY());
      if(result.ok()) {
        if(script_mode) m61_text::claim_display();
        return true;
      }
      Serial.print("Print error: ");
      Serial.println(m61_print::error_message(result.error));
      return false;
    }

