bolknote/MK61S_MINI/code/terminal.cpp
terminal_protocol::Result class_terminal::exec_if(bool script_mode, bool trap_mode) {
      const char* p = command_args();
      double lhs = 0.0;
      double rhs = 0.0;
      bool parsed = parse_if_operand(p, lhs);

      char op0 = 0;
      char op1 = 0;
      if(parsed) {
        p = terminal_core::skip_spaces(p);
        op0 = p[0];
        if(op0 == '>' || op0 == '<' || op0 == '=' || op0 == '!') {
          p++;
          if(*p == '=') { op1 = '='; p++; }
        }
        parsed = (op0 == '>' || op0 == '<') || ((op0 == '=' || op0 == '!') && op1 == '=');
      }
      if(parsed) parsed = parse_if_operand(p, rhs);

      const char* tail = terminal_core::skip_spaces(p);
      if(!parsed || *tail == 0) {
        recive_pos = 0;
        Serial.println("Usage: if <x|y|z|t|x1|r0..re> <op> <value> <command>");
        return terminal_protocol::Result::error();
      }

      bool condition = false;
      if(op0 == '>') condition = op1 ? (lhs >= rhs) : (lhs > rhs);
      if(op0 == '<') condition = op1 ? (lhs <= rhs) : (lhs < rhs);
      if(op0 == '=') condition = (lhs == rhs);
      if(op0 == '!') condition = (lhs != rhs);

      if(!condition) {
        recive_pos = 0;
        return terminal_protocol::Result::ok();
      }

      // Условие истинно: остаток строки выполняется как обычная команда.
      const usize tail_len = strlen(tail);
      memmove(input_buffer, tail, tail_len);
      input_buffer[tail_len] = CR; // контракт execute(): последний символ CR
      recive_pos = tail_len + 1;
      return execute(script_mode, trap_mode);
    }

terminal_protocol::Result class_terminal::execute(bool script_mode,
                                      bool trap_mode) {
        if(recive_pos == 0 || recive_pos > MAX_INPUT_CHAR) return terminal_protocol::Result::error();
#if defined(MK61_OLED1602_WS0010)
        idle_signal_reset();
#endif
        input_buffer[--recive_pos] = 0;
        // Интерактивный терминал использует общее с M61 ядро. Он не должен
        // обходить приостановленную ловушку прямым изменением через kbd/cmd/run.
        if(m61_text::calculator_suspended()) trap_mode = true;
        if(!script_mode && current_directory != program_store::ROOT_ID) {
          program_store::Entry cwd_entry;
          if(!program_store::entry_by_id(current_directory, cwd_entry) ||
             cwd_entry.kind != program_store::NodeKind::DIRECTORY) {
            current_directory = program_store::ROOT_ID;
          }
        }
        if(!script_mode) Serial.println();
        dbgln(MINI,"[", recive_pos, "] '", (char*) input_buffer);

        if(!script_mode && pending_confirmation_cmd != CMD_UNKNOWN) {
          const u8 pending = pending_confirmation_cmd;
          pending_confirmation_cmd = CMD_UNKNOWN;
          if(terminal_core::exact_confirmation((const char*) input_buffer, 'y')) {
            bool ok = true;
            switch(pending) {
              case CMD_CLEAR:
                MK61Emu_ClearCodePage();
                Serial.println("Code page cleared!");
                break;
              case CMD_DEL_SLOT:
                ok = DeleteSlot(nSlot);
                if(!ok) Serial.println("Delete failed (no such file?)");
                break;
              case CMD_SAVE:
                ok = pending_save_name[0] != 0
                    ? StoreProgram(pending_save_parent_id, pending_save_name)
                    : Store(nSlot);
                if(!ok) Serial.println("Failed save attempt!");
                break;
              case CMD_ERASE_STORAGE:
                ok = clear_storage();
                break;
              default:
                ok = false;
                break;
            }
            pending_save_name[0] = 0;
            pending_save_parent_id = program_store::ROOT_ID;
            nSlot = -1;
            recive_pos = 0;
            return ok ? terminal_protocol::Result::ok() : terminal_protocol::Result::error();
          }
          if(terminal_core::exact_confirmation((const char*) input_buffer, 'n')) {
            pending_save_name[0] = 0;
            pending_save_parent_id = program_store::ROOT_ID;
            nSlot = -1;
            recive_pos = 0;
            Serial.println("Cancelled.");
            return terminal_protocol::Result::ok();
          }
          // Любая команда, кроме отдельного Y/N, отменяет устаревший запрос.
          pending_save_name[0] = 0;
          pending_save_parent_id = program_store::ROOT_ID;
          nSlot = -1;
        }

        const u8 command_id = terminal_catalog::lookup(&input_buffer[0]);
        dbgln(MINI, "command id ", (int) command_id);
        if(script_mode && !terminal_command_allowed_in_script(command_id)) {
          Serial.print("Command is not allowed in M61 scripts: ");
          Serial.println((const char*) input_buffer);
          recive_pos = 0;
          return terminal_protocol::Result::error();
        }
        if(trap_mode && !terminal_command_allowed_in_trap(command_id)) {
          Serial.print("Command is not allowed in an M61 trap handler: ");
          Serial.println((const char*) input_buffer);
          recive_pos = 0;
          return terminal_protocol::Result::error();
        }
        // Незавершённая загрузка не должна переживать переход к другой
        // команде. Рабочая область между пакетами всё равно не удерживается.
        if(command_id != CMD_FS_PUT) cancel_file_upload();
        switch (command_id) {
          case  CMD_VERSION:
              output_version();
            break;
          case CMD_IDENTITY: {
              const terminal_protocol::Result result = exec_identity();
              recive_pos = 0;
              return result;
            }
#if MK61_ENABLE_READ_BENCHMARKS
          case CMD_BENCHMARK: {
              const terminal_protocol::Result result = exec_benchmark();
              recive_pos = 0;
              return result;
            }
#endif
          case  CMD_DATE: {
              const terminal_protocol::Result result = exec_date();
              recive_pos = 0;
              return result;
            }
#if MK61_ENABLE_RTC_ALARM_TERMINAL
          case CMD_ALARM: {
              const terminal_protocol::Result result = exec_alarm();
              recive_pos = 0;
              return result;
            }
#endif
          case  CMD_ISA:
              echo_ISA_61();
            break;
          case  CMD_LIST:
              list_mk61_code_page();
            break;
          case  CMD_RESET:
              if(terminal_core::at_end(command_args())) {
                if(Confirmation()) NVIC_SystemReset();
                break;
              }
              {
                const char* cursor = command_args();
                char action[4] = {};
                if(!terminal_core::parse_token(
                     cursor, action, sizeof(action)) ||
                   strcmp(action, "now") != 0 ||
                   !terminal_core::at_end(cursor)) {
                  Serial.println("Usage: rst [now]");
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
                // An explicit one-line token is intended for unattended HIL.
                // Flush the acknowledgement before CDC disappears; ordinary
                // interactive `rst` keeps the physical-key confirmation.
                Serial.println("Resetting.");
                Serial.flush();
                delay(20);
                NVIC_SystemReset();
              }
            break;
          case CMD_REINIT:
              if(!terminal_core::at_end(command_args())) {
                Serial.println("Usage: reinit");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(script_mode) {
                return script_action(
                    terminal_protocol::ResultKind::REINIT_CALCULATOR, "");
              }
              m61_text::cancel();
              reinit_mk61_calculator_state();
              Serial.println("Calculator reinitialized.");
            break;
          case CMD_DFU:
              if(terminal_core::at_end(command_args())) {
                DFU_enable();
                break;
              } else {
                const char* cursor = command_args();
                char action[8];
                if(!terminal_core::parse_token(
                       cursor, action, sizeof(action)) ||
                   strcmp(action, "status") != 0 ||
                   !terminal_core::at_end(cursor)) {
                  Serial.println("Usage: dfu [status]");
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
                const early_dfu::Diagnostic diagnostic =
                    early_dfu::diagnostic();
                terminal_output::field(Serial, "DFU status valid=", diagnostic.valid ? 1 : 0);
                terminal_output::field(Serial, " generation=", diagnostic.generation);
                Serial.print(" stage=");
                Serial.print(early_dfu::diagnostic_stage_name(
                    diagnostic.stage));
                terminal_output::line(Serial, " sources=0x", diagnostic.sources, HEX);
                recive_pos = 0;
                return terminal_protocol::Result::ok();
              }
#if MK61_ENABLE_USB_SCREEN
          case  CMD_USB_SCREEN:
              if(!terminal_core::at_end(command_args())) {
                Serial.println("Usage: uscreen");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(!usb_screen::start()) {
                Serial.println("USB Screen is unavailable.");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              Serial.println("USB Screen starting.");
            break;
#endif
          case CMD_MEMORY: {
              const terminal_protocol::Result result = exec_memory();
              recive_pos = 0;
              return result;
            }
          case CMD_DISPLAY: {
              const terminal_protocol::Result result = exec_display();
              recive_pos = 0;
              return result;
            }
#if MK61_DWT_PROFILER_SUPPORTED
          case CMD_PROFILE: {
              const terminal_protocol::Result result = exec_profile();
              recive_pos = 0;
              return result;
          }
#endif
#if MK61_CRASH_DUMP_SUPPORTED
          case CMD_CRASH: {
              const terminal_protocol::Result result = exec_crash();
              recive_pos = 0;
              return result;
            }
#endif
#if MK61_INDEPENDENT_WATCHDOG_SUPPORTED
          case CMD_WATCHDOG: {
              const terminal_protocol::Result result = exec_watchdog();
              recive_pos = 0;
              return result;
            }
#endif
#if MK61_MPU_GUARD_SUPPORTED
          case CMD_MPU: {
              const terminal_protocol::Result result = exec_mpu();
              recive_pos = 0;
              return result;
            }
#endif
          case  CMD_REG_DUMP:
              DumpRegisters();
            break;
          case  CMD_REG_SET: {
              // Индекс - hex-цифра: R0..RE, RF только в расширенной памяти
              // (иначе запись ушла бы за пределы классического кольца).
              const isize reg = HexdecimalDigit((char) input_buffer[1]);
              const isize reg_limit = core_61::expanded_program_is_on() ? 15 : 14;
              if(reg < 0 || reg > reg_limit) {
                Serial.println("Illegal register, R0..RE (RF in expanded mode)!");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(!write_register_value((u8) reg, command_args())) {
                Serial.println("Usage: R<0..F>= <finite number with exponent -99..99>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
            }
            break;
          case  CMD_1302:
              Dump1302();
            break;
          case  CMD_CLEAR:
          case  CMD_ERASE_STORAGE:
              pending_confirmation_cmd = command_id;
              Serial.println("Enter Y/y to confirm the operation!");
            break;
          case  CMD_CMD: {
              const terminal_protocol::Result result = command_to_kbd(script_mode);
              recive_pos = 0;
              return result;
            }
          case  CMD_KBD: {
              i32 scancode = -1;
              if(!scancode_to_kbd(scancode)) {
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              // В скрипте клавиша нажимается сразу на ядре, интерактивно —
              // скан-код уходит в буфер клавиатуры через loop().
              if(script_mode) {
                recive_pos = 0;
                return hidden_press_scan_code(scancode) ? terminal_protocol::Result::ok() : terminal_protocol::Result::error();
              }
              recive_pos = 0;
              return terminal_protocol::Result::keyboard(scancode);
            }
          case  CMD_DISASM:  // включить/выключить режим верхней строки с дизассемблером МК61
              config.disassm = disassembler.turn_on_off();
            break;
          case  CMD_SAVE: {
              const char* args = command_args();
              usize slot = 0;
              pending_save_name[0] = 0;
              pending_save_parent_id = program_store::ROOT_ID;
              if(terminal_parse_slot_arg(args, slot)) {
                nSlot = (isize) slot;
              } else {
                storage_path::FileTarget target = {};
                const storage_path::Status status = storage_path::file_target(
                    current_directory, args, program_store::ProgramType::MK61,
                    target);
                if(status != storage_path::Status::OK) {
                  terminal_path_error("save", status);
                  Serial.println("Usage: save <slot|path[.m61]>");
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
                nSlot = -1;
                pending_save_parent_id = target.parent_id;
                bounded_string::copy(pending_save_name, target.name);
              }
              pending_confirmation_cmd = CMD_SAVE;
              Serial.println("Enter Y/y to confirm the operation!");
            }
            break;
          case  CMD_LOAD: {
              const char* args = command_args();
              usize slot = 0;
              if(terminal_parse_slot_arg(args, slot)) {
                // В скрипте слот выполняется вложенно (Load() отменил бы сценарий).
                if(script_mode) return script_action(terminal_protocol::ResultKind::LOAD_SLOT, args);
                if(!Load(slot)) {
                  Serial.println("Failed load attempt!");
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
              } else {
                if(script_mode) return script_action(terminal_protocol::ResultKind::OPEN_FILE, args);
                program_store::Entry entry;
                const storage_path::Status status = storage_path::resolve_file(
                    current_directory, args, program_store::ProgramType::MK61,
                    entry);
                if(status != storage_path::Status::OK) {
                  terminal_path_error("load", status);
                  Serial.println("Usage: load <slot|path[.m61]>");
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
                if(!LoadProgram(entry.id)) {
                  Serial.println("Failed load attempt!");
                  recive_pos = 0;
                  return terminal_protocol::Result::error();
                }
              }
            }
            break;
          case  CMD_PUB:
              pub_mk61_code_page();
            break;
          case  CMD_DUMP:
              dump_mk61_code_page();
            break;
          case  CMD_RING: {
              usize i = 0;
              usize n_chip = 0;
              usize count = 0;
              const ring_M::K745* chips = ring_M::active_chips();
              const usize chip_count = ring_M::active_chip_count();
              const usize ring_size = core_61::ring_size();
              Serial.print("MK61 ring M dump:");
              while(count < ring_size) {
                const u8 ring_cell = ringM[count];
                if(i == 0) {
                  i = 42;
                  Serial.println();
                  if(n_chip < chip_count && chips[n_chip].OFFSET == count) Serial.println(chips[n_chip++].NAME);

