bolknote/MK61S_MINI/code/terminal.cpp
                 milliseconds == 0) {
                Serial.println("Usage in M61: wait <1..60000>");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              recive_pos = 0;
              return terminal_protocol::Result::wait((i32) milliseconds);
            }
          case CMD_RET:
              if(!terminal_core::at_end(command_args())) {
                Serial.println("Usage: ret");
                recive_pos = 0;
                return terminal_protocol::Result::error();
              }
              if(script_mode) {
                return script_action(
                    terminal_protocol::ResultKind::RETURN_SCRIPT, "");
              }
              Serial.println("ret works in M61 scripts only!");
              recive_pos = 0;
              return terminal_protocol::Result::error();
          case  CMD_HISTORY:
              history_print();
            break;
          default:
              if(input_buffer[0] != 0) {
                Serial.print("Unknown command: ");
                Serial.println((const char*) input_buffer);
              }
              recive_pos = 0;
              return terminal_protocol::Result::error();
        }

      recive_pos = 0;
      return terminal_protocol::Result::ok();
    }

class_terminal::InputResult class_terminal::input_handler(u8 rx_char) {
      terminal_line_editor::Key escape_key;
      if(escape_decoder.feed(rx_char, escape_key)) {
        if(!input_overflow) editor_key(escape_key);
        return {-1, false};
      }

      if(rx_char == CR || rx_char == NL) {
        if(prev_terminator != 0 && rx_char != prev_terminator) {
          prev_terminator = 0; // второй символ пары CRLF/LFCR
          return {-1, false};
        }
        prev_terminator = rx_char;

        if(input_overflow) {
          // Переполненная строка отбрасывается целиком: выполнять обрезанную
          // команду нельзя (поток может идти и с другого устройства, без
          // реакции на звуковой сигнал занятости).
          input_overflow = false;
          recive_pos = 0;
          input_cursor = 0;
          Serial.println();
          Serial.println("Error: input line too long, command ignored!");
          print_prompt();
          return {-1, true};
        }

        if(recive_pos == 0) { // пустая строка - только новое приглашение
          input_cursor = 0;
          Serial.println();
          print_prompt();
          return {-1, false};
        }

        history_add(input_buffer, recive_pos);
        hist_nav = -1;

        input_buffer[recive_pos++] = CR; // контракт execute(): последний символ CR
        const terminal_protocol::Result result = execute();
        input_cursor = 0;
        print_prompt();
        return {
          result.kind == terminal_protocol::ResultKind::KEY ? result.key : -1,
          true,
        };
      }
      prev_terminator = 0;

      if(rx_char == 0x08 || rx_char == 0x7F) { // Удаление предыдущего символа
        if(!input_overflow) editor_backspace();
        return {-1, false};
      }

      // Стандартные управляющие клавиши остаются полезны в клиентах, которые
      // не передают Home/End или Delete как ANSI-последовательность.
      if(!input_overflow) {
        switch(rx_char) {
          case 0x01: editor_move_home();      return {-1, false}; // Ctrl+A
          case 0x02: editor_move_left();      return {-1, false}; // Ctrl+B
          case 0x04: editor_delete_forward(); return {-1, false}; // Ctrl+D
          case 0x05: editor_move_end();       return {-1, false}; // Ctrl+E
          case 0x06: editor_move_right();     return {-1, false}; // Ctrl+F
          default: break;
        }
      }

      // Управляющие символы, кроме табуляции, не буферизуем.
      if(rx_char < 0x20 && rx_char != '\t') return {-1, false};

      if(input_can_append() && editor_insert(rx_char)) {
        // editor_insert() выводит обычное эхо либо перерисовывает хвост строки.
      } else if(!input_overflow) {
        input_overflow = true; // сигнал занятости - один раз на строку
        sound(PIN_BUZZER, 4000, 750, library_mk61::sound_volume());
      }
      return {-1, false};
    }

i32 class_terminal::serial_input_handler() {
      while(Serial.peek() >= 0) { // получен символ
        const InputResult result = input_handler((u8) Serial.read());
        // Остаток потока обработается в следующем вызове: каждая строка
        // выполняется до чтения следующей, пакетный ввод не склеивается.
        if(result.line_complete) return result.key;
      }
      return -1;
    }



terminal_protocol::Result class_terminal::execute_script_line(
    const char* line, bool trap_mode) {
  if(line == NULL) return terminal_protocol::Result::error();

  // input_buffer один на прошивку: пока скрипт исполняется между итерациями
  // loop(), в буфере может лежать недонабранная строка интерактивного
  // терминала. Сохраняем её на стеке и возвращаем после выполнения строки.
  u8 interactive_line[MAX_INPUT_CHAR];
  memcpy(interactive_line, input_buffer, MAX_INPUT_CHAR);

  terminal_protocol::Result result = terminal_protocol::Result::error();
  usize len = 0;
  bool too_long = false;
  while(line[len] != 0) {
    if(!terminal_core::input_can_append(len)) {
      too_long = true;
      break;
    }
    input_buffer[len] = (u8) line[len];
    len++;
  }

  if(too_long) {
    recive_pos = 0;
  } else {
    input_buffer[len] = CR;
    recive_pos = len + 1;
    result = execute(true, trap_mode);
  }

  // Действия с аргументом возвращают указатель внутрь временного input_buffer.
  // Исходная строка вызывающего живёт до обработки Result, поэтому сохраняем
  // не второй 240-байтный текст, а тот же проверенный offset.
  if(!terminal_core::rebind_script_argument(
       line, len, input_buffer, MAX_INPUT_CHAR, result.args)) {
    result = terminal_protocol::Result::error();
  }
  memcpy(input_buffer, interactive_line, MAX_INPUT_CHAR);
  return result;
}
